slides/2012-09-28-Github.org
* RESTful in Action :slide:center:
Use Github's API

* =curl= :slide:
  + Command-line URL
  + Shortcut for manually making Telnet requests
  + turned into a library
** We'll just use command line :notes:

* Show Headers :slide:
#+begin_src bash
curl -i http://people.ischool.berkeley.edu/~jblomo/
#+end_src

#+begin_src http
HTTP/1.1 200 OK
Date: Fri, 28 Sep 2012 06:25:13 GMT
Server: Apache/2.2.22 (Fedora)
Last-Modified: Fri, 31 Aug 2012 23:27:30 GMT
ETag: "a6ec002-48-4c89822b95c80"
Accept-Ranges: bytes
Content-Length: 72
Content-Type: text/html; charset=UTF-8
#+end_src

#+begin_src html
<h1>Jim's page</h1>
Pretty <strong>cool!</strong>

Hello <em>class</em>
#+end_src

