slides/2012-09-28-Github.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>2012-09-28-Github</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="title" content="2012-09-28-Github"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2012-09-28 00:11:14 PDT"/>
<meta name="author" content="Jim Blomo"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>

<link rel="stylesheet" type="text/css" href="production/common.css" />
<link rel="stylesheet" type="text/css" href="production/screen.css" media="screen" />
<link rel="stylesheet" type="text/css" href="production/projection.css" media="projection" />
<link rel="stylesheet" type="text/css" href="production/color-blue.css" media="projection" />
<link rel="stylesheet" type="text/css" href="production/presenter.css" media="presenter" />
<link href='http://fonts.googleapis.com/css?family=Lobster+Two:700|Yanone+Kaffeesatz:700|Open+Sans' rel='stylesheet' type='text/css'>


</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">2012-09-28-Github</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 RESTful in Action</a></li>
<li><a href="#sec-2">2 <code>curl</code></a>
<ul>
<li><a href="#sec-2-1">2.1 We'll just use command line</a></li>
</ul>
</li>
<li><a href="#sec-3">3 Show Headers</a></li>
<li><a href="#sec-4">4 Github API</a></li>
<li><a href="#sec-5">5 Homework</a></li>
<li><a href="#sec-6">6 Submit Homework by Email</a></li>
<li><a href="#sec-7">7 Don't forget your Project</a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> RESTful in Action &nbsp;&nbsp;&nbsp;<span class="tag"><span class="slide">slide</span>&nbsp;<span class="center">center</span></span></h2>
<div class="outline-text-2" id="text-1">

<p>Use Github's API
</p>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> <code>curl</code> &nbsp;&nbsp;&nbsp;<span class="tag"><span class="slide">slide</span></span></h2>
<div class="outline-text-2" id="text-2">

<ul>
<li>Command-line URL
</li>
<li>Shortcut for manually making Telnet requests
</li>
<li>turned into a library
</li>
</ul>


</div>

<div id="outline-container-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> We'll just use command line &nbsp;&nbsp;&nbsp;<span class="tag"><span class="notes">notes</span></span></h3>
<div class="outline-text-3" id="text-2-1">


</div>
</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Show Headers &nbsp;&nbsp;&nbsp;<span class="tag"><span class="slide">slide</span></span></h2>
<div class="outline-text-2" id="text-3">




<pre class="src src-bash">curl -i http://people.ischool.berkeley.edu/~jblomo/
</pre>



<pre class="src src-http">HTTP/1.1 200 OK
Date: Fri, 28 Sep 2012 06:25:13 GMT
Server: Apache/2.2.22 (Fedora)
Last-Modified: Fri, 31 Aug 2012 23:27:30 GMT
ETag: <span style="color: #8b2252;">"a6ec002-48-4c89822b95c80"</span>
Accept-Ranges: bytes
Content-Length: 72
Content-Type: text/html; charset=UTF-8
</pre>



<pre class="src src-html">&lt;<span style="color: #0000ff;">h1</span>&gt;<span style="font-weight: bold; text-decoration: underline;">Jim's page</span>&lt;/<span style="color: #0000ff;">h1</span>&gt;
Pretty &lt;<span style="color: #0000ff;">strong</span>&gt;<span style="font-weight: bold;">cool!</span>&lt;/<span style="color: #0000ff;">strong</span>&gt;

Hello &lt;<span style="color: #0000ff;">em</span>&gt;<span style="text-decoration: underline;">class</span>&lt;/<span style="color: #0000ff;">em</span>&gt;
</pre>


</div>

</div>
